---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkOptions.SetWorksetConfiguration(Autodesk.Revit.DB.WorksetConfiguration)
source: html/8e0fe0c5-3dd9-806b-6e0d-d42f8d498be2.htm
---
# Autodesk.Revit.DB.RevitLinkOptions.SetWorksetConfiguration Method

Sets the set of worksets to open when creating the link.

## Syntax (C#)
```csharp
public void SetWorksetConfiguration(
	WorksetConfiguration config
)
```

## Parameters
- **config** (`Autodesk.Revit.DB.WorksetConfiguration`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null